# Learning Pandas

In [2]:
import pandas as pd

data = {'Name':['John', 'Anna', 'Peter'],
        'Location' : ['Buea', 'Limbe', 'Kumba'],
        'Age': [23, 25, 67]
       }
df = pd.DataFrame(data)
df

    Name Location  Age
0   John     Buea   23
1   Anna    Limbe   25
2  Peter    Kumba   67

In [6]:
data = {'year': [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018],
        'team':  ['barcelona', 'barcelona', 'barcelona', 'rmadrid', 'rmadrid', 'rmadrid', 'rmadrid', 'valencia', 'valencia'],
        'wins': [30, 29, 28, 20, 30, 20, 34, 29, 29],
        'draws': [2, 4, 6, 2, 4, 6, 3, 5, 7],
        'loses' : [1, 2, 3, 1, 2, 3, 1, 2, 3]
}
df2 = pd.DataFrame(data)
df2

   year       team  wins  draws  loses
0  2010  barcelona    30      2      1
1  2011  barcelona    29      4      2
2  2012  barcelona    28      6      3
3  2013    rmadrid    20      2      1
4  2014    rmadrid    30      4      2
5  2015    rmadrid    20      6      3
6  2016    rmadrid    34      3      1
7  2017   valencia    29      5      2
8  2018   valencia    29      7      3

In [11]:
years = df2['year']
years

0    2010
1    2011
2    2012
3    2013
4    2014
5    2015
6    2016
7    2017
8    2018
Name: year, dtype: int64

In [12]:
area = pd.read_csv("areas.csv")
area

    area
0   1000
1   1500
2   2300
3   3540
4   4120
5   4560
6   5490
7   3460
8   4750
9   2300
10  9000
11  8600
12  7100

In [13]:
weather_df = pd.read_csv('weather_data.csv')
weather_df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [14]:
homeprice_df = pd.read_csv("homeprices.csv")
homeprice_df

   area   price
0  2600  550000
1  3000  565000
2  3200  610000
3  3600  680000
4  4000  725000

In [15]:
salaries_df = pd.read_csv('salaries.csv')
salaries_df

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [16]:
full_data = pd.read_csv(r'/Users/mrfomfoh/Downloads/ML)Info')
full_data

,Unnamed: 0,year,month,intent,police,sex,age,race,hispanic,place,education
0,1,2012,1,Suicide,0,M,34.0,Asian/Pacific Islander,100,Home,BA+
1,2,2012,1,Suicide,0,F,21.0,White,100,Street,Some college
2,3,2012,1,Suicide,0,M,60.0,White,100,Other specified,BA+
3,4,2012,2,Suicide,0,M,64.0,White,100,Home,BA+
4,5,2012,2,Suicide,0,M,31.0,White,100,Other specified,HS/GED
...,...,...,...,...,...,...,...,...,...,...,...
100793,100794,2014,12,Homicide,0,M,36.0,Black,100,Home,HS/GED
100794,100795,2014,12,Homicide,0,M,19.0,Black,100,Street,HS/GED
100795,100796,2014,12,Homicide,0,M,20.0,Black,100,Street,HS/GED
100796,100797,2014,12,Homicide,0,M,22.0,Hispanic,260,Street,Less than HS
100797,100798,2014,10,Homicide,0,M,43.0,Black,100,Other unspecified,HS/GED